name:"detection_out"

input:"mbox_loc"
input_shape
{
 dim:1
 dim:34928
}

input:"mbox_conf"
input_shape
{
 dim:1
 dim:183372
}

input:"mbox_priorbox"
input_shape
{
 dim:1
 dim:2
 dim:34928
}

input:"label"
input_shape
{
 dim:1
 dim:1
 dim:1
 dim:8
}

layer {
  name: "mbox_conf_reshape"
  type: "Reshape"
  bottom: "mbox_conf"
  top: "mbox_conf_reshape"
  reshape_param {
    shape {
      dim: 0
      dim: -1
      dim: 21
    }
  }
}
layer {
  name: "mbox_conf_softmax"
  type: "Softmax"
  bottom: "mbox_conf_reshape"
  top: "mbox_conf_softmax"
  softmax_param {
    axis: 2
  }
}
layer {
  name: "mbox_conf_flatten"
  type: "Flatten"
  bottom: "mbox_conf_softmax"
  top: "mbox_conf_flatten"
  flatten_param {
    axis: 1
  }
}


layer {
  name: "detection_out"
  type: "DetectionOutput"
  bottom: "mbox_loc"
  bottom: "mbox_conf_flatten"
  bottom: "mbox_priorbox"
  top: "detection_out"
  detection_output_param {
    num_classes: 21
    share_location: true
    background_label_id: 0
    nms_param {
      nms_threshold: 0.449999988079
      top_k: 400
    }
    code_type: CENTER_SIZE
    keep_top_k: 200
    confidence_threshold: 0.00999999977648
  }
}

layer{
  name: "detection_eval"
  type: "DetectionEvaluate"
  bottom:"detection_out"
  bottom:"label"
  top:"detection"
  detection_evaluate_param{
    num_classes:21
    background_label_id: 0
    overlap_threshold: 0.001
    evaluate_difficult_gt: false  
    name_size_file:"/home/ernie/caffe2/caffe2/python/ssd_test/detection_eval/test_name_size.txt"  
  }
}

