force_backward:true
input:"mbox_loc"
input_shape
{
 dim:1
 dim:34928
}

input:"mbox_conf"
input_shape
{
 dim:1
 dim:183372
}

input:"mbox_priorbox"
input_shape
{
 dim:1
 dim:2
 dim:34928
}

input:"gt_label"
input_shape
{
 dim:1
 dim:1
 dim:1
 dim:8
}

layer{

name:"mbox_loss"
type:"MultiBoxLoss"
bottom:"mbox_loc"
bottom:"mbox_conf"
bottom:"mbox_priorbox"
bottom:"gt_label"
top:"mbox_loss"

propagate_down:true
propagate_down:true
propagate_down:false
propagate_down:false

loss_param{
   normalization:VALID
}

multibox_loss_param{
 loc_loss_type:SMOOTH_L1
 conf_loss_type:SOFTMAX
 loc_weight:1.0
 num_classes: 21
 share_location : true
 match_type: PER_PREDICTION
 overlap_threshold: 0.5
 use_prior_for_matching: true
 background_label_id: 0
 use_difficult_gt: true
 neg_pos_ratio: 3.0
 neg_overlap: 0.5
 code_type: CENTER_SIZE
 ignore_cross_boundary_bbox: false
 mining_type: MAX_NEGATIVE
}

}
